% pm.Constants.m
classdef Constants
    properties (Constant)
        % システムパラメータ
        pi = 3.141592653589793;
        g = 9.8;
        
        % システム次元
        nx = 6;  % 状態変数の数
        ni = 1;  % 入力の数
        ns = 3;  % サンプリング数
        
        % 時間パラメータ
        t0 = 0.0;
        t1 = 1.8;
        t2 = 10.0;
        dt = 0.01;
        N = 181;  % t1/dt + 1
        N2 = 1001;  % t2/dt + 1
        
        % 振子が質点モデルの場合↓
        r_0 = 0.3; % アーム半径 [m]
        l_1 = 0.2; % 振子1 質点までの距離 [m]
        l_2 = 0.1; % 振子2 質点までの距離 [m]
        c_1 = 0.001; % 振子1 減衰係数 [N·m·s/rad]
        c_2 = 0.001; % 振子2 減衰係数 [N·m·s/rad]
        m_1 = 1; % 振子1の質点の重さ [kg]
        m_2 = 1; % 振子2の質点の重さ [kg] 
        
        % ノミナルプラントパラメータ
        an1 = pm.Constants.r_0 / pm.Constants.l_1;
        wn1 = pm.Constants.g   / pm.Constants.l_1;
        cn1 = pm.Constants.c_1 / (pm.Constants.m_1 * pm.Constants.l_1^2);
        an2 = pm.Constants.r_0 / pm.Constants.l_2;
        wn2 = pm.Constants.g   / pm.Constants.l_2;
        cn2 = pm.Constants.c_2 / (pm.Constants.m_2 * pm.Constants.l_2^2);

        % モデル化誤差を入れた、実プラントパラメータ
        ap1 = pm.Constants.an1 * 0.9;
        wp1 = pm.Constants.wn1 * 0.9;
        cp1 = pm.Constants.cn1 * 0.9;
        ap2 = pm.Constants.an2 * 0.9;
        wp2 = pm.Constants.wn2 * 0.9;
        cp2 = pm.Constants.cn2 * 0.9;

        % ソルバーパラメータ
        k_max = 10000;
        
        % コスト関数の重み
        s = [10000.0; 10000.0; 80000.0; 5000.0; 80000.0; 5000.0];
        q = [1.0; 1.0; 1.0; 5.0; 1.0; 5.0];
        r = 1.0;
        
        % レギュレータの重み
        % 
        % sr = [1; 1; 10000.0; 100.0; 10000.0; 100.0]*1;
        % Kstabを求めるときに得た行列Pの値をSRとして与えると、終端時刻でのK(t1)がKstabに一致する
        SR = [5.07207951467646	12.3629953049804	-587.310350186505	-83.7516923790750	408.812975267312	41.0881810875487;
            12.3629953049804	57.2418898707541	-2894.83345523727	-412.809317695108	2032.02657986084	204.230960603118;
            -587.310350186502	-2894.83345523726	1205104.70034769	171851.374408063	-981448.163691187	-98640.1858086338;
            -83.7516923790747	-412.809317695108	171851.374408063	24506.5829346399	-139957.689319601	-14066.4102211684;
            408.812975267310	2032.02657986083	-981448.163691185	-139957.689319601	823085.104531553	82723.6416229266;
            41.0881810875485	204.230960603118	-98640.1858086335	-14066.4102211684	82723.6416229267	8314.14198102698];

        qr = [1.0; 1.0; 10.0; 1.0; 10.0; 1.0];
        rr = 100.0;
    end
end